cf_billing/InformationRegisters/энргСтатусЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСтатусЗадачи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСтатусыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сформирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятаВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/InformationRegisters/энргСтатусЗадачи/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет статус задач.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура СтатусЗадач(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеПомещения());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
	
	ПараметрПериод 						= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Задача";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыОтбора") Тогда
		ДоступныеПараметры = "Статус";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор, "энргСтатусЗадачиСрезПоследних", ПараметрыОтбора.ПараметрыОтбора, ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает задачи в статусе принято в работу.
//
// Параметры:
//  Период	-	Дата.
//  Задачи	-	ЗадачаСсылка.энргЗадачаПИД.
// 
// Возвращаемое значение:
//   ЗадачаСсылка.энргЗадачаПИД.
//
Функция ПолучитьЗадачиВСтатусеПринятоВРаботу(Период, Задачи = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтатусЗадачиСрезПоследних.Задача КАК Задача
		|ИЗ
		|	РегистрСведений.энргСтатусЗадачи.СрезПоследних(&Период, Задача в (&Задачи)) КАК энргСтатусЗадачиСрезПоследних
		|ГДЕ
		|	энргСтатусЗадачиСрезПоследних.Статус = &ПринятоВРаботу";
	
	
	Запрос.УстановитьПараметр("Период"			, Период);
	Запрос.УстановитьПараметр("Задачи"			, Задачи);
	Запрос.УстановитьПараметр("ПринятоВРаботу"	, Перечисления.энргСтатусыЗадач.ПринятаВРаботу);
	Если Задачи = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Задача в (&Задачи)", "");
	КонецЕсли; 	
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДанныеПомещения()
	
	Текст  		=
	"ВЫБРАТЬ
	|	энргСтатусЗадачиСрезПоследних.Задача КАК Задача,
	|	энргСтатусЗадачиСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.энргСтатусЗадачи.СрезПоследних(&Период) КАК энргСтатусЗадачиСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
